diary/2024-01-07.html
<!doctype html>
<html lang="ja">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>ABC 335, PBT 本 - toybeam</title>
    <meta name="description" content="devlog of toyboot4e" />
    <link rel="stylesheet" href="/style/simple.min.css" />
    <link rel="stylesheet" href="/style/style.css" />
    <link rel="stylesheet" href="/style/prism.css" />
    <!-- MathJax -->
  </head>
  <body>
    <header role="banner">
      <h1>ABC 335, PBT 本</h1>
      <p>Jan 7, 2024</p>
      <nav role="navigation">
        <a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a>
      </nav>
    </header>
    <main role="main">
      <h2 id="競技プログラミング"><a href="#競技プログラミング">競技プログラミング</a></h2>
      <h3 id="訓練"><a href="#訓練">訓練</a></h3>
      <p>青 diff の AC 数が 50 を超えた。自力で解ける気配は無い。<br /></p>

      <p>
        <a
          href="https://www.google.com/search?q=%E3%83%9E%E3%82%B9%E3%82%BF%E3%83%BC%E3%83%BB%E3%82%AA%E3%83%96%E3%83%BB%E5%A0%B4%E5%90%88%E3%81%AE%E6%95%B0"
          >マスター・オブ・場合の数</a
        >
        の §1 を解いた。意外と DP の観点が役立つ。<br />
      </p>
      <h3 id="ABC 335"><a href="#ABC 335">ABC 335</a></h3>
      <p>
        <a href="https://atcoder.jp/contests/abc335">ABC 335</a> に参加した。 4 完だった。<br />
      </p>
      <h4 id="感想"><a href="#感想">感想</a></h4>
      <p>今回も手続き型言語 Haskell でゴリ押ししてしまった。<br /></p>

      <p>茶 diff の C, D が難しかった。来週は緑色コーダーに戻るかもしれない。<br /></p>
      <h4 id="解法"><a href="#解法">解法</a></h4>
      <p>
        <a href="https://atcoder.jp/contests/abc335/tasks/abc335_a">A 問題</a> では
        <code>(`snoc` '4')</code> とか <code>(&lt;&gt; "4")</code> が書けたら格好良かった。<br />
      </p>

      <p>
        <a href="https://atcoder.jp/contests/abc335/tasks/abc335_b">B 問題</a> は
        <code>nubSort $ 全探索</code> の形で解いた。タイピングが苦手なので、空白区切りの
        <code>putStrLn</code> をスニペットに入れようと思った。<br />
      </p>

      <p>
        <a href="https://atcoder.jp/contests/abc335/tasks/abc335_c">C 問題</a>
        ではスネークゲームを連想して混乱した。先頭の残像の位置が問われると思えば、可変配列をリングバッファとして使ったり、
        <code>cojna/iota</code> の <code>Data.Buffer</code> に
        <code>pushBack</code> していけば良かった。<br />
      </p>

      <p>
        より上手な解答として可変配列を使わない提出が見れた。
        <code>scanl</code>
        で位置の一覧を作ってから、改めてクエリに答えていくみたい。頭を使う必要があって難度は上がると思う。<br />
      </p>

      <p>
        <a href="https://atcoder.jp/contests/abc335/tasks/abc335_d">D 問題</a>
        では螺旋状に答えを作っていけば良いことが分かった。内周がこれ:<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-txt"> --|
 |T|
 |--
</code></pre>
      </div>

      <p>1 つ外側の周がこれ:<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-txt">----|
|   |
| T |
|   |
|----
</code></pre>
      </div>

      <p>
        それぞれの周を描くためには、左上の頂点からスタートし、長さ \(2 i\) の辺を 4 回描いた。
        <code>accumArray</code> などは使わず、可変配列へ都度答えを書き込んだ。<br />
      </p>

      <p>
        別解としては、外周から始めて内周へと近づいていけば、壁 or 探索済みのセルにぶつかる度に 90
        度回転するだけで済むため、簡単になりそう。<br />
      </p>

      <p>
        <a href="https://atcoder.jp/contests/abc335/tasks/abc335_e">E 問題</a>
        は苦手なグラフ問題に見えて飛ばした。最長距離を求める不思議な問題だった。<br />
      </p>

      <p>
        コンテスト後に Dijkstra や 01-BFS っぽいのを投げてみたものの TLE
        。もともと最短経路を求めるアルゴリズムだし、やっぱり上手く行かないみたい。同じ数が振られた隣接頂点を
        1 つに潰すと DAG になり、 DP で解けるそう。後でやってみる。<br />
      </p>

      <p>
        <a href="https://atcoder.jp/contests/abc335/tasks/abc335_f">F 問題</a>
        が解けなかった。右端から計算する方針は立てたものの、高速化ができなかった。
        <a href="https://www.youtube.com/watch?v=cJiP8-Mq1jI&amp;t=199s">evima さんの解法</a>
        に従って \(dp[x][i \bmod x]\) を周期和とすることで upsolve できた。力こそパワー……<br />
      </p>
      <h2 id="読書: PBT 本"><a href="#読書: PBT 本">読書: PBT 本</a></h2>
      <p>
        <a href="https://www.lambdanote.com/collections/proper-erlang-elixir"
          >実践プロパティベーステスト</a
        >
        を 28% まで読んだ。ジェネレータが生成したテストケースを分類し、何 %
        のテストがどの分類にあたるかを確認できることを知った。<br />
      </p>

      <p>
        実際、ランダムなテストケースを作るだけでは、境界値を見れず素通りする確率が高い。 AtCoder
        における QuickCheck
        の使い方としては、実質的に総当たりをしていた。自分でループを書いても良いが、失敗したケースの表示まで
        QuickCheck がやってくれる点が便利だった。<br />
      </p>

      <p>
        PBT 自体の良さはまだ感じ取れていない。
        <a href="https://matklad.github.io/2023/10/06/what-is-an-invariant.html"
          >matklad 氏が invariant 大好きマンなので</a
        >
        、彼の視点を理解するためにも読み進めてみたい。<br />
      </p>
    </main>
    <footer role="contentinfo">
      <p>Styled with <a href="https://simplecss.org/">Simple.css</a></p>
      <div><a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div>
    </footer>
  </body>
</html>
